#2.1
a = input("Введите пароль")
b = input("Введите пароль ещё раз")

if a == b:
    print ("Пароль принят")
else:
    print("Пароль не принят")


#2.2
a = int(input("Введите номер места в плацкартном вагоне: "))

if a % 2 == 0:  # если номер места четный
    if a >= 37:
        b = "верхнее боковое"
    else:
        b = "верхнее плацкартное"
else:  # если номер места нечетный
    if a >= 37:
        b = "нижнее боковое"
    else:
        b = "нижнее плацкартное"

print(f"Место {a} - это {b} место.")


#2.3
a = int(input("Введите год: "))

if (a % 4 == 0 and a % 100 != 0) or a % 400 == 0:
    print(f"Год {a} - високосный")
else:
    print("Этот год не високосный")


#2.4
color1 = input("Введите первый цвет (красный, синий или желтый): ")
color2 = input("Введите второй цвет (красный, синий или желтый): ")

if color1 not in ["красный", "синий", "желтый"] or color2 not in ["красный", "синий", "желтый"]:
    print("Ошибка! Введите только красный, синий или желтый.")
else:
    if (color1 == "красный" and color2 == "синий") or (color1 == "синий" and color2 == "красный"):
        print("Фиолетовый")
    elif (color1 == "красный" and color2 == "желтый") or (color1 == "желтый" and color2 == "красный"):
        print("Оранжевый")
    elif (color1 == "синий" and color2 == "желтый") or (color1 == "желтый" and color2 == "синий"):
        print("Зеленый")